---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalLink
source: html/a7c59105-2284-6eeb-bcc4-b9e96f012be2.htm
---
# AnalyticalLink Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.